Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0512GPE064.atdf
         <register caption="ADC Trigger Source 4 Register" name="ADCTRG4" offset="0x230" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of Analog Input AN12 Select bits" mask="0x0000001F" name="TRGSRC12" values="ADCTRG4__TRGSRC12" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN13 Select bits" mask="0x00001F00" name="TRGSRC13" values="ADCTRG4__TRGSRC13" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN14 Select bits" mask="0x001F0000" name="TRGSRC14" values="ADCTRG4__TRGSRC14" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN15 Select bits" mask="0x1F000000" name="TRGSRC15" values="ADCTRG4__TRGSRC15" />
         </register>
         <register caption="ADC Trigger Source 5 Register" name="ADCTRG5" offset="0x240" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of Analog Input AN16 Select bits" mask="0x0000001F" name="TRGSRC16" values="ADCTRG5__TRGSRC16" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN17 Select bits" mask="0x00001F00" name="TRGSRC17" values="ADCTRG5__TRGSRC17" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN18 Select bits" mask="0x001F0000" name="TRGSRC18" values="ADCTRG5__TRGSRC18" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN19 Select bits" mask="0x1F000000" name="TRGSRC19" values="ADCTRG5__TRGSRC19" />
         </register>
         <register caption="ADC Trigger Source 6 Register" name="ADCTRG6" offset="0x250" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of Analog Input AN20 Select bits" mask="0x0000001F" name="TRGSRC20" values="ADCTRG6__TRGSRC20" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN21 Select bits" mask="0x00001F00" name="TRGSRC21" values="ADCTRG6__TRGSRC21" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN22 Select bits" mask="0x001F0000" name="TRGSRC22" values="ADCTRG6__TRGSRC22" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN23 Select bits" mask="0x1F000000" name="TRGSRC23" values="ADCTRG6__TRGSRC23" />
         </register>
         <register caption="ADC Trigger Source 7 Register" name="ADCTRG7" offset="0x260" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of Analog Input AN24 Select bits" mask="0x0000001F" name="TRGSRC24" values="ADCTRG7__TRGSRC24" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN25 Select bits" mask="0x00001F00" name="TRGSRC25" values="ADCTRG7__TRGSRC25" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN26 Select bits" mask="0x001F0000" name="TRGSRC26" values="ADCTRG7__TRGSRC26" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN27 Select bits" mask="0x1F000000" name="TRGSRC27" values="ADCTRG7__TRGSRC27" />
         </register>
         <register caption="ADC Digital Comparator 1 Control Register" name="ADCCMPCON1" offset="0x280" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator 0 Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON1__IELOLO" />
            <bitfield caption="Low/High Digital Comparator 0 Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON1__IELOHI" />
            <bitfield caption="High/Low Digital Comparator 0 Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON1__IEHILO" />
            <bitfield caption="High/High Digital Comparator 0 Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON1__IEHIHI" />
            <bitfield mask="0x00000010" name="IEBTWN" />
            <bitfield caption="Digital Comparator 1 ??Output True? Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON1__DCMPED" />
            <bitfield caption="Digital Comparator 1 Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON1__DCMPGIEN" />
            <bitfield caption="Digital Comparator 1 Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON1__ENDCMP" />
            <bitfield caption="Digital Comparator 1 Analog Input Identification bits" mask="0x00003F00" name="AINID" values="ADCCMPCON1__AINID" />
            <bitfield mask="0xFFFF0000" name="CVDDATA" />
         </register>
         <register caption="ADC Digital Comparator 'x' Control Register ('x' = 2 through 4)" name="ADCCMPCON2" offset="0x290" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator x Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON2__IELOLO" />
            <bitfield caption="Low/High Digital Comparator x Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON2__IELOHI" />
            <bitfield caption="High/Low Digital Comparator x Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON2__IEHILO" />
            <bitfield caption="High/High Digital Comparator x Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON2__IEHIHI" />
            <bitfield mask="0x00000010" name="IEBTWN" />
            <bitfield caption="Digital Comparator 'x' &quot;Output True&quot; Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON2__DCMPED" />
            <bitfield caption="Digital Comparator 'x' Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON2__DCMPGIEN" />
            <bitfield caption="Digital Comparator 'x' Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON2__ENDCMP" />
            <bitfield caption="Digital Comparator 'x' Analog Input Identification bits" mask="0x00001F00" name="AINID" values="ADCCMPCON2__AINID" />
         </register>
         <register caption="ADC Digital Comparator 'x' Control Register ('x' = 2 through 4)" name="ADCCMPCON3" offset="0x2a0" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator x Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON3__IELOLO" />
            <bitfield caption="Low/High Digital Comparator x Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON3__IELOHI" />
            <bitfield caption="High/Low Digital Comparator x Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON3__IEHILO" />
            <bitfield caption="High/High Digital Comparator x Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON3__IEHIHI" />
            <bitfield mask="0x00000010" name="IEBTWN" />
            <bitfield caption="Digital Comparator 'x' &quot;Output True&quot; Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON3__DCMPED" />
            <bitfield caption="Digital Comparator 'x' Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON3__DCMPGIEN" />
            <bitfield caption="Digital Comparator 'x' Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON3__ENDCMP" />
            <bitfield caption="Digital Comparator 'x' Analog Input Identification bits" mask="0x00001F00" name="AINID" values="ADCCMPCON3__AINID" />
         </register>
         <register caption="ADC Digital Comparator 'x' Control Register ('x' = 2 through 4)" name="ADCCMPCON4" offset="0x2b0" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator x Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON4__IELOLO" />
            <bitfield caption="Low/High Digital Comparator x Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON4__IELOHI" />
            <bitfield caption="High/Low Digital Comparator x Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON4__IEHILO" />
            <bitfield caption="High/High Digital Comparator x Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON4__IEHIHI" />
            <bitfield mask="0x00000010" name="IEBTWN" />
            <bitfield caption="Digital Comparator 'x' &quot;Output True&quot; Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON4__DCMPED" />
            <bitfield caption="Digital Comparator 'x' Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON4__DCMPGIEN" />
            <bitfield caption="Digital Comparator 'x' Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON4__ENDCMP" />
            <bitfield caption="Digital Comparator 'x' Analog Input Identification bits" mask="0x00001F00" name="AINID" values="ADCCMPCON4__AINID" />
         </register>
