Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0512GPE064.atdf
         <register caption="ADC Output Data Register 'x'" name="ADCDATA4" offset="0x640" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA5" offset="0x650" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA6" offset="0x660" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA7" offset="0x670" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA8" offset="0x680" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA9" offset="0x690" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA10" offset="0x6a0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA11" offset="0x6b0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA12" offset="0x6c0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA13" offset="0x6d0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA14" offset="0x6e0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA15" offset="0x6f0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA16" offset="0x700" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA17" offset="0x710" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA18" offset="0x720" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA19" offset="0x730" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA24" offset="0x780" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA25" offset="0x790" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA26" offset="0x7a0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA27" offset="0x7b0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA48" offset="0x900" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA49" offset="0x910" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA50" offset="0x920" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA52" offset="0x940" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x'" name="ADCDATA53" offset="0x950" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
      </register-group>
      <value-group caption="DMA to System RAM Buffer Length Size bits" name="ADCCON1__DMABL">
         <value caption="Allocates 128 locations in system memory to each analog input" name="" value="0x7" />
         <value caption="Allocates 64 locations in system memory to each analog input" name="" value="0x6" />
         <value caption="Allocates 32 locations in system memory to each analog input" name="" value="0x5" />
         <value caption="Allocates 16 locations in system memory to each analog input" name="" value="0x4" />
         <value caption="Allocates 8 locations in system memory to each analog input" name="" value="0x3" />
         <value caption="Allocates 4 locations in system memory to each analog input" name="" value="0x2" />
         <value caption="Allocates 2 locations in system memory to each analog input" name="" value="0x1" />
         <value caption="Allocates 1 location in system memory to each analog input" name="" value="0x0" />
      </value-group>
      <value-group caption="Scan Trigger High Level/Positive Edge Sensitivity bit" name="ADCCON1__STRGLVL">
         <value caption="Scan trigger is high level sensitive. Once STRIG mode is selected the scan trigger will continue for all selected analog inputs" name="" value="0x1" />
         <value caption="Scan trigger is positive edge sensitive. Once STRIG mode is selected only a single scan trigger will be generated which will complete the scan of all selected analog inputs. (TRGSRCx in the ADCTRGx register)" name="" value="0x0" />
      </value-group>
