Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0512GPE064.atdf
      <value-group caption="Digital Comparator 1 Enable bit" name="ADCCMPCON1__ENDCMP">
         <value caption="Digital Comparator 1 is enabled" name="" value="0x1" />
         <value caption="Digital Comparator 1 is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 1 Analog Input Identification bits" name="ADCCMPCON1__AINID">
         <value caption="Reserved" name="" value="0x3f" />
         <value caption="Reserved" name="" value="0x36" />
         <value caption="Internal AN53 (CTMU temperature sensor)" name="" value="0x35" />
         <value caption="Internal AN52 (Vbat/2)" name="" value="0x35" />
         <value caption="Reserved" name="" value="0x35" />
         <value caption="Internal AN50 (IVref 1.2V)" name="" value="0x32" />
         <value caption="AN49 is being monitored" name="" value="0x31" />
         <value caption="AN45 is being monitored" name="" value="0x2d" />
         <value caption="Reserved" name="" value="0x2c" />
         <value caption="Reserved" name="" value="0x2a" />
         <value caption="AN41 is being monitored" name="" value="0x29" />
         <value caption="AN33 is being monitored" name="" value="0x21" />
         <value caption="Reserved" name="" value="0x3c" />
         <value caption="Reserved" name="" value="0x38" />
         <value caption="AN27 is being monitored" name="" value="0x3b" />
         <value caption="AN0 is being monitored" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/Low Digital Comparator x Event bit" name="ADCCMPCON2__IELOLO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits &lt; DCMPLO&lt;15:0&gt; bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/High Digital Comparator x Event bit" name="ADCCMPCON2__IELOHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPLO bits &lt; DATA&lt;31:0&gt; bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low Digital Comparator x Event bit" name="ADCCMPCON2__IEHILO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits &lt; DCMPHI&lt;15:0&gt; bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="High/High Digital Comparator x Event bit" name="ADCCMPCON2__IEHIHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPHI bits &lt;= DATA&lt;31:0&gt; bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 'x' &quot;Output True&quot; Event Status bit" name="ADCCMPCON2__DCMPED">
         <value caption="Digital Comparator x output true event has occurred (output of Comparator is 1)" name="" value="0x1" />
         <value caption="Digital Comparator x output is false (output of Comparator is 0)" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 'x' Global Interrupt Enable bit" name="ADCCMPCON2__DCMPGIEN">
         <value caption="A Digital Comparator x interrupt is generated when the DCMPED status bit (ADCCMPxCON) is set" name="" value="0x1" />
         <value caption="A Digital Comparator x interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 'x' Enable bit" name="ADCCMPCON2__ENDCMP">
         <value caption="Digital Comparator x is enabled" name="" value="0x1" />
         <value caption="Digital Comparator x is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 'x' Analog Input Identification bits" name="ADCCMPCON2__AINID">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1c" />
         <value caption="AN27" name="" value="0x1b" />
         <value caption="AN26" name="" value="0x1a" />
         <value caption="AN25" name="" value="0x19" />
         <value caption="AN24" name="" value="0x18" />
         <value caption="AN23" name="" value="0x17" />
         <value caption="AN22" name="" value="0x16" />
         <value caption="AN21" name="" value="0x15" />
         <value caption="AN20" name="" value="0x14" />
         <value caption="AN19" name="" value="0x13" />
         <value caption="AN1" name="" value="0x1" />
         <value caption="AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/Low Digital Comparator x Event bit" name="ADCCMPCON3__IELOLO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits &lt; DCMPLO&lt;15:0&gt; bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/High Digital Comparator x Event bit" name="ADCCMPCON3__IELOHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPLO bits &lt; DATA&lt;31:0&gt; bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low Digital Comparator x Event bit" name="ADCCMPCON3__IEHILO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits &lt; DCMPHI&lt;15:0&gt; bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="High/High Digital Comparator x Event bit" name="ADCCMPCON3__IEHIHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPHI bits &lt;= DATA&lt;31:0&gt; bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 'x' &quot;Output True&quot; Event Status bit" name="ADCCMPCON3__DCMPED">
         <value caption="Digital Comparator x output true event has occurred (output of Comparator is 1)" name="" value="0x1" />
         <value caption="Digital Comparator x output is false (output of Comparator is 0)" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 'x' Global Interrupt Enable bit" name="ADCCMPCON3__DCMPGIEN">
         <value caption="A Digital Comparator x interrupt is generated when the DCMPED status bit (ADCCMPxCON) is set" name="" value="0x1" />
         <value caption="A Digital Comparator x interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 'x' Enable bit" name="ADCCMPCON3__ENDCMP">
         <value caption="Digital Comparator x is enabled" name="" value="0x1" />
         <value caption="Digital Comparator x is not enabled" name="" value="0x0" />
      </value-group>
