Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0512GPE064.atdf
         <register caption="CAN Module Control Register" name="C3CON" offset="0x4000" rw="RW" size="4">
            <bitfield caption="Device Net Filter Bit Number bits" mask="0x0000001F" name="DNCNT" values="C3CON__DNCNT" />
            <bitfield caption="CAN Module is Busy bit" mask="0x00000800" name="CANBUSY" values="C3CON__CANBUSY" />
            <bitfield caption="CAN Stop in Idle bit" mask="0x00002000" name="SIDL" values="C3CON__SIDL" />
            <bitfield caption="CAN On bit" mask="0x00008000" name="ON" values="C3CON__ON" />
            <bitfield caption="CAN Message Receive Time Stamp Timer Capture Enable bit" mask="0x00100000" name="CANCAP" values="C3CON__CANCAP" />
            <bitfield caption="Operation Mode Status bits" mask="0x00E00000" name="OPMOD" values="C3CON__OPMOD" />
            <bitfield caption="Request Operation Mode bits" mask="0x07000000" name="REQOP" values="C3CON__REQOP" />
            <bitfield caption="Abort All Pending Transmissions bit" mask="0x08000000" name="ABAT" values="C3CON__ABAT" />
         </register>
         <register caption="CAN Module Control Register" name="C4CON" offset="0x5000" rw="RW" size="4">
            <bitfield caption="Device Net Filter Bit Number bits" mask="0x0000001F" name="DNCNT" values="C4CON__DNCNT" />
            <bitfield caption="CAN Module is Busy bit" mask="0x00000800" name="CANBUSY" values="C4CON__CANBUSY" />
            <bitfield caption="CAN Stop in Idle bit" mask="0x00002000" name="SIDL" values="C4CON__SIDL" />
            <bitfield caption="CAN On bit" mask="0x00008000" name="ON" values="C4CON__ON" />
            <bitfield caption="CAN Message Receive Time Stamp Timer Capture Enable bit" mask="0x00100000" name="CANCAP" values="C4CON__CANCAP" />
            <bitfield caption="Operation Mode Status bits" mask="0x00E00000" name="OPMOD" values="C4CON__OPMOD" />
            <bitfield caption="Request Operation Mode bits" mask="0x07000000" name="REQOP" values="C4CON__REQOP" />
            <bitfield caption="Abort All Pending Transmissions bit" mask="0x08000000" name="ABAT" values="C4CON__ABAT" />
         </register>
         <register caption="CAN Baud Rate Configuration Register" name="C1CFG" offset="0x10" rw="RW" size="4">
            <bitfield caption="Baud Rate Prescaler bits" mask="0x0000003F" name="BRP" values="C1CFG__BRP" />
            <bitfield caption="Synchronization Jump Width bits" mask="0x000000C0" name="SJW" values="C1CFG__SJW" />
            <bitfield caption="Propagation Time Segment bits" mask="0x00000700" name="PRSEG" values="C1CFG__PRSEG" />
            <bitfield caption="Phase Buffer Segment 1 bits" mask="0x00003800" name="SEG1PH" values="C1CFG__SEG1PH" />
            <bitfield caption="Sample of the CAN Bus Line bit" mask="0x00004000" name="SAM" values="C1CFG__SAM" />
            <bitfield caption="Phase Segment 2 Time Select bit" mask="0x00008000" name="SEG2PHTS" values="C1CFG__SEG2PHTS" />
            <bitfield caption="Phase Buffer Segment 2 bits" mask="0x00070000" name="SEG2PH" values="C1CFG__SEG2PH" />
            <bitfield caption="CAN Bus Line Filter Enable bit" mask="0x00400000" name="WAKFIL" values="C1CFG__WAKFIL" />
         </register>
         <register caption="CAN Baud Rate Configuration Register" name="C2CFG" offset="0x1010" rw="RW" size="4">
            <bitfield caption="Baud Rate Prescaler bits" mask="0x0000003F" name="BRP" values="C2CFG__BRP" />
            <bitfield caption="Synchronization Jump Width bits" mask="0x000000C0" name="SJW" values="C2CFG__SJW" />
            <bitfield caption="Propagation Time Segment bits" mask="0x00000700" name="PRSEG" values="C2CFG__PRSEG" />
            <bitfield caption="Phase Buffer Segment 1 bits" mask="0x00003800" name="SEG1PH" values="C2CFG__SEG1PH" />
            <bitfield caption="Sample of the CAN Bus Line bit" mask="0x00004000" name="SAM" values="C2CFG__SAM" />
            <bitfield caption="Phase Segment 2 Time Select bit" mask="0x00008000" name="SEG2PHTS" values="C2CFG__SEG2PHTS" />
            <bitfield caption="Phase Buffer Segment 2 bits" mask="0x00070000" name="SEG2PH" values="C2CFG__SEG2PH" />
            <bitfield caption="CAN Bus Line Filter Enable bit" mask="0x00400000" name="WAKFIL" values="C2CFG__WAKFIL" />
         </register>
         <register caption="CAN Baud Rate Configuration Register" name="C3CFG" offset="0x4010" rw="RW" size="4">
            <bitfield caption="Baud Rate Prescaler bits" mask="0x0000003F" name="BRP" values="C3CFG__BRP" />
            <bitfield caption="Synchronization Jump Width bits" mask="0x000000C0" name="SJW" values="C3CFG__SJW" />
            <bitfield caption="Propagation Time Segment bits" mask="0x00000700" name="PRSEG" values="C3CFG__PRSEG" />
            <bitfield caption="Phase Buffer Segment 1 bits" mask="0x00003800" name="SEG1PH" values="C3CFG__SEG1PH" />
            <bitfield caption="Sample of the CAN Bus Line bit" mask="0x00004000" name="SAM" values="C3CFG__SAM" />
            <bitfield caption="Phase Segment 2 Time Select bit" mask="0x00008000" name="SEG2PHTS" values="C3CFG__SEG2PHTS" />
            <bitfield caption="Phase Buffer Segment 2 bits" mask="0x00070000" name="SEG2PH" values="C3CFG__SEG2PH" />
            <bitfield caption="CAN Bus Line Filter Enable bit" mask="0x00400000" name="WAKFIL" values="C3CFG__WAKFIL" />
         </register>
         <register caption="CAN Baud Rate Configuration Register" name="C4CFG" offset="0x5010" rw="RW" size="4">
            <bitfield caption="Baud Rate Prescaler bits" mask="0x0000003F" name="BRP" values="C4CFG__BRP" />
            <bitfield caption="Synchronization Jump Width bits" mask="0x000000C0" name="SJW" values="C4CFG__SJW" />
            <bitfield caption="Propagation Time Segment bits" mask="0x00000700" name="PRSEG" values="C4CFG__PRSEG" />
            <bitfield caption="Phase Buffer Segment 1 bits" mask="0x00003800" name="SEG1PH" values="C4CFG__SEG1PH" />
            <bitfield caption="Sample of the CAN Bus Line bit" mask="0x00004000" name="SAM" values="C4CFG__SAM" />
            <bitfield caption="Phase Segment 2 Time Select bit" mask="0x00008000" name="SEG2PHTS" values="C4CFG__SEG2PHTS" />
            <bitfield caption="Phase Buffer Segment 2 bits" mask="0x00070000" name="SEG2PH" values="C4CFG__SEG2PH" />
            <bitfield caption="CAN Bus Line Filter Enable bit" mask="0x00400000" name="WAKFIL" values="C4CFG__WAKFIL" />
         </register>
         <register caption="CAN Interrupt Register" name="C1INT" offset="0x20" rw="RW" size="4">
            <bitfield caption="Transmit Buffer Interrupt Flag bit" mask="0x00000001" name="TBIF" values="C1INT__TBIF" />
            <bitfield caption="Receive Buffer Interrupt Flag bit" mask="0x00000002" name="RBIF" values="C1INT__RBIF" />
            <bitfield caption="CAN Timer Overflow Interrupt Flag bit" mask="0x00000004" name="CTMRIF" values="C1INT__CTMRIF" />
            <bitfield caption="CAN Mode Change Interrupt Flag bit" mask="0x00000008" name="MODIF" values="C1INT__MODIF" />
            <bitfield caption="Receive Buffer Overflow Interrupt Flag bit" mask="0x00000800" name="RBOVIF" values="C1INT__RBOVIF" />
            <bitfield caption="System Error Interrupt Flag bit" mask="0x00001000" name="SERRIF" values="C1INT__SERRIF" />
            <bitfield caption="CAN Bus Error Interrupt Flag bit" mask="0x00002000" name="CERRIF" values="C1INT__CERRIF" />
            <bitfield caption="CAN Bus Activity Wake-up Interrupt Flag bit" mask="0x00004000" name="WAKIF" values="C1INT__WAKIF" />
            <bitfield caption="Invalid Message Received Interrupt Flag bit" mask="0x00008000" name="IVRIF" values="C1INT__IVRIF" />
            <bitfield caption="Transmit Buffer Interrupt Enable bit" mask="0x00010000" name="TBIE" values="C1INT__TBIE" />
            <bitfield caption="Receive Buffer Interrupt Enable bit" mask="0x00020000" name="RBIE" values="C1INT__RBIE" />
            <bitfield caption="CAN Timestamp Timer Interrupt Enable bit" mask="0x00040000" name="CTMRIE" values="C1INT__CTMRIE" />
            <bitfield caption="Mode Change Interrupt Enable bit" mask="0x00080000" name="MODIE" values="C1INT__MODIE" />
            <bitfield caption="Receive Buffer Overflow Interrupt Enable bit" mask="0x08000000" name="RBOVIE" values="C1INT__RBOVIE" />
            <bitfield caption="System Error Interrupt Enable bit" mask="0x10000000" name="SERRIE" values="C1INT__SERRIE" />
            <bitfield caption="CAN Bus Error Interrupt Enable bit" mask="0x20000000" name="CERRIE" values="C1INT__CERRIE" />
            <bitfield caption="CAN Bus Activity Wake-up Interrupt Enable bit" mask="0x40000000" name="WAKIE" values="C1INT__WAKIE" />
            <bitfield caption="Invalid Message Received Interrupt Enable bit" mask="0x80000000" name="IVRIE" values="C1INT__IVRIE" />
         </register>
