Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0512GPE064.atdf
         <register caption="CAN Filter Control Register 0" name="C4FLTCON0" offset="0x50c0" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL0" values="C4FLTCON0__FSEL0" />
            <bitfield caption="Filter 0 Mask Select bits" mask="0x00000060" name="MSEL0" values="C4FLTCON0__MSEL0" />
            <bitfield caption="Filter 0 Enable bit" mask="0x00000080" name="FLTEN0" values="C4FLTCON0__FLTEN0" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL1" values="C4FLTCON0__FSEL1" />
            <bitfield caption="Filter 1 Mask Select bits" mask="0x00006000" name="MSEL1" values="C4FLTCON0__MSEL1" />
            <bitfield caption="Filter 1 Enable bit" mask="0x00008000" name="FLTEN1" values="C4FLTCON0__FLTEN1" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL2" values="C4FLTCON0__FSEL2" />
            <bitfield caption="Filter 2 Mask Select bits" mask="0x00600000" name="MSEL2" values="C4FLTCON0__MSEL2" />
            <bitfield caption="Filter 2 Enable bit" mask="0x00800000" name="FLTEN2" values="C4FLTCON0__FLTEN2" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL3" values="C4FLTCON0__FSEL3" />
            <bitfield caption="Filter 3 Mask Select bits" mask="0x60000000" name="MSEL3" values="C4FLTCON0__MSEL3" />
            <bitfield caption="Filter 3 Enable bit" mask="0x80000000" name="FLTEN3" values="C4FLTCON0__FLTEN3" />
         </register>
         <register caption="CAN Filter Control Register 1" name="C1FLTCON1" offset="0xd0" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL4" values="C1FLTCON1__FSEL4" />
            <bitfield caption="Filter 4 Mask Select bits" mask="0x00000060" name="MSEL4" values="C1FLTCON1__MSEL4" />
            <bitfield caption="Filter 4 Enable bit" mask="0x00000080" name="FLTEN4" values="C1FLTCON1__FLTEN4" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL5" values="C1FLTCON1__FSEL5" />
            <bitfield caption="Filter 5 Mask Select bits" mask="0x00006000" name="MSEL5" values="C1FLTCON1__MSEL5" />
            <bitfield caption="Filter 17 Enable bit" mask="0x00008000" name="FLTEN5" values="C1FLTCON1__FLTEN5" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL6" values="C1FLTCON1__FSEL6" />
            <bitfield caption="Filter 6 Mask Select bits" mask="0x00600000" name="MSEL6" values="C1FLTCON1__MSEL6" />
            <bitfield caption="Filter 6 Enable bit" mask="0x00800000" name="FLTEN6" values="C1FLTCON1__FLTEN6" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL7" values="C1FLTCON1__FSEL7" />
            <bitfield caption="Filter 7 Mask Select bits" mask="0x60000000" name="MSEL7" values="C1FLTCON1__MSEL7" />
            <bitfield caption="Filter 7 Enable bit" mask="0x80000000" name="FLTEN7" values="C1FLTCON1__FLTEN7" />
         </register>
         <register caption="CAN Filter Control Register 1" name="C2FLTCON1" offset="0x10d0" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL4" values="C2FLTCON1__FSEL4" />
            <bitfield caption="Filter 4 Mask Select bits" mask="0x00000060" name="MSEL4" values="C2FLTCON1__MSEL4" />
            <bitfield caption="Filter 4 Enable bit" mask="0x00000080" name="FLTEN4" values="C2FLTCON1__FLTEN4" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL5" values="C2FLTCON1__FSEL5" />
            <bitfield caption="Filter 5 Mask Select bits" mask="0x00006000" name="MSEL5" values="C2FLTCON1__MSEL5" />
            <bitfield caption="Filter 17 Enable bit" mask="0x00008000" name="FLTEN5" values="C2FLTCON1__FLTEN5" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL6" values="C2FLTCON1__FSEL6" />
            <bitfield caption="Filter 6 Mask Select bits" mask="0x00600000" name="MSEL6" values="C2FLTCON1__MSEL6" />
            <bitfield caption="Filter 6 Enable bit" mask="0x00800000" name="FLTEN6" values="C2FLTCON1__FLTEN6" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL7" values="C2FLTCON1__FSEL7" />
            <bitfield caption="Filter 7 Mask Select bits" mask="0x60000000" name="MSEL7" values="C2FLTCON1__MSEL7" />
            <bitfield caption="Filter 7 Enable bit" mask="0x80000000" name="FLTEN7" values="C2FLTCON1__FLTEN7" />
         </register>
         <register caption="CAN Filter Control Register 1" name="C3FLTCON1" offset="0x40d0" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL4" values="C3FLTCON1__FSEL4" />
            <bitfield caption="Filter 4 Mask Select bits" mask="0x00000060" name="MSEL4" values="C3FLTCON1__MSEL4" />
            <bitfield caption="Filter 4 Enable bit" mask="0x00000080" name="FLTEN4" values="C3FLTCON1__FLTEN4" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL5" values="C3FLTCON1__FSEL5" />
            <bitfield caption="Filter 5 Mask Select bits" mask="0x00006000" name="MSEL5" values="C3FLTCON1__MSEL5" />
            <bitfield caption="Filter 17 Enable bit" mask="0x00008000" name="FLTEN5" values="C3FLTCON1__FLTEN5" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL6" values="C3FLTCON1__FSEL6" />
            <bitfield caption="Filter 6 Mask Select bits" mask="0x00600000" name="MSEL6" values="C3FLTCON1__MSEL6" />
            <bitfield caption="Filter 6 Enable bit" mask="0x00800000" name="FLTEN6" values="C3FLTCON1__FLTEN6" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL7" values="C3FLTCON1__FSEL7" />
            <bitfield caption="Filter 7 Mask Select bits" mask="0x60000000" name="MSEL7" values="C3FLTCON1__MSEL7" />
            <bitfield caption="Filter 7 Enable bit" mask="0x80000000" name="FLTEN7" values="C3FLTCON1__FLTEN7" />
         </register>
