Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0512GPE064.atdf
      <value-group caption="Invalid Message Received Interrupt Flag bit" name="C2INT__IVRIF">
         <value caption="An invalid messages interrupt has occurred" name="" value="0x1" />
         <value caption="An invalid message interrupt has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Interrupt Enable bit" name="C2INT__TBIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Interrupt Enable bit" name="C2INT__RBIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Timestamp Timer Interrupt Enable bit" name="C2INT__CTMRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Mode Change Interrupt Enable bit" name="C2INT__MODIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Overflow Interrupt Enable bit" name="C2INT__RBOVIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="System Error Interrupt Enable bit" name="C2INT__SERRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Bus Error Interrupt Enable bit" name="C2INT__CERRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Bus Activity Wake-up Interrupt Enable bit" name="C2INT__WAKIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Invalid Message Received Interrupt Enable bit" name="C2INT__IVRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Interrupt Flag bit" name="C3INT__TBIF">
         <value caption="A transmit buffer interrupt is pending" name="" value="0x1" />
         <value caption="A transmit buffer interrupt is not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Interrupt Flag bit" name="C3INT__RBIF">
         <value caption="A receive buffer interrupt is pending" name="" value="0x1" />
         <value caption="A receive buffer interrupt is not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Timer Overflow Interrupt Flag bit" name="C3INT__CTMRIF">
         <value caption="A CAN timer (CANTMR) overflow has occurred" name="" value="0x1" />
         <value caption="A CAN timer (CANTMR) overflow has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Mode Change Interrupt Flag bit" name="C3INT__MODIF">
         <value caption="A CAN module mode change has occurred (OPMOD has changed to reflect REQOP)" name="" value="0x1" />
         <value caption="A CAN module mode change has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Overflow Interrupt Flag bit" name="C3INT__RBOVIF">
         <value caption="A receive buffer overflow has occurred" name="" value="0x1" />
         <value caption="A receive buffer overflow has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="System Error Interrupt Flag bit" name="C3INT__SERRIF">
         <value caption="A system error occurred (typically an illegal address was presented to the System Bus)" name="" value="0x1" />
         <value caption="A system error has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Bus Error Interrupt Flag bit" name="C3INT__CERRIF">
         <value caption="A CAN bus error has occurred" name="" value="0x1" />
         <value caption="A CAN bus error has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Bus Activity Wake-up Interrupt Flag bit" name="C3INT__WAKIF">
         <value caption="A bus wake-up activity interrupt has occurred" name="" value="0x1" />
         <value caption="A bus wake-up activity interrupt has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Invalid Message Received Interrupt Flag bit" name="C3INT__IVRIF">
         <value caption="An invalid messages interrupt has occurred" name="" value="0x1" />
         <value caption="An invalid message interrupt has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Interrupt Enable bit" name="C3INT__TBIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Interrupt Enable bit" name="C3INT__RBIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Timestamp Timer Interrupt Enable bit" name="C3INT__CTMRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Mode Change Interrupt Enable bit" name="C3INT__MODIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Overflow Interrupt Enable bit" name="C3INT__RBOVIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="System Error Interrupt Enable bit" name="C3INT__SERRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Bus Error Interrupt Enable bit" name="C3INT__CERRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
