Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0512GPE064.atdf
      <value-group caption="CAN Bus Activity Wake-up Interrupt Enable bit" name="C3INT__WAKIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Invalid Message Received Interrupt Enable bit" name="C3INT__IVRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Interrupt Flag bit" name="C4INT__TBIF">
         <value caption="A transmit buffer interrupt is pending" name="" value="0x1" />
         <value caption="A transmit buffer interrupt is not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Interrupt Flag bit" name="C4INT__RBIF">
         <value caption="A receive buffer interrupt is pending" name="" value="0x1" />
         <value caption="A receive buffer interrupt is not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Timer Overflow Interrupt Flag bit" name="C4INT__CTMRIF">
         <value caption="A CAN timer (CANTMR) overflow has occurred" name="" value="0x1" />
         <value caption="A CAN timer (CANTMR) overflow has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Mode Change Interrupt Flag bit" name="C4INT__MODIF">
         <value caption="A CAN module mode change has occurred (OPMOD has changed to reflect REQOP)" name="" value="0x1" />
         <value caption="A CAN module mode change has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Overflow Interrupt Flag bit" name="C4INT__RBOVIF">
         <value caption="A receive buffer overflow has occurred" name="" value="0x1" />
         <value caption="A receive buffer overflow has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="System Error Interrupt Flag bit" name="C4INT__SERRIF">
         <value caption="A system error occurred (typically an illegal address was presented to the System Bus)" name="" value="0x1" />
         <value caption="A system error has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Bus Error Interrupt Flag bit" name="C4INT__CERRIF">
         <value caption="A CAN bus error has occurred" name="" value="0x1" />
         <value caption="A CAN bus error has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Bus Activity Wake-up Interrupt Flag bit" name="C4INT__WAKIF">
         <value caption="A bus wake-up activity interrupt has occurred" name="" value="0x1" />
         <value caption="A bus wake-up activity interrupt has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Invalid Message Received Interrupt Flag bit" name="C4INT__IVRIF">
         <value caption="An invalid messages interrupt has occurred" name="" value="0x1" />
         <value caption="An invalid message interrupt has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Interrupt Enable bit" name="C4INT__TBIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Interrupt Enable bit" name="C4INT__RBIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Timestamp Timer Interrupt Enable bit" name="C4INT__CTMRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Mode Change Interrupt Enable bit" name="C4INT__MODIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Overflow Interrupt Enable bit" name="C4INT__RBOVIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="System Error Interrupt Enable bit" name="C4INT__SERRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Bus Error Interrupt Enable bit" name="C4INT__CERRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Bus Activity Wake-up Interrupt Enable bit" name="C4INT__WAKIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Invalid Message Received Interrupt Enable bit" name="C4INT__IVRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1" />
         <value caption="Interrupt request is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Flag Code bits" name="C1VEC__ICODE">
         <value caption="Reserved" name="" value="1001000-1111111" />
         <value caption="Invalid message received (IVRIF)" name="" value="0x48" />
         <value caption="CAN module mode change (MODIF)" name="" value="0x47" />
         <value caption="CAN timestamp timer (CTMRIF)" name="" value="0x46" />
         <value caption="Bus bandwidth error (SERRIF)" name="" value="0x45" />
         <value caption="Address error interrupt (SERRIF)" name="" value="0x44" />
         <value caption="Receive FIFO overflow interrupt (RBOVIF)" name="" value="0x43" />
         <value caption="Wake-up interrupt (WAKIF)" name="" value="0x42" />
         <value caption="Error Interrupt (CERRIF)" name="" value="0x41" />
         <value caption="No interrupt" name="" value="0x40" />
         <value caption="Reserved" name="" value="0100000-0111111" />
         <value caption="FIFO31 Interrupt (CiFSTAT set)" name="" value="0x1f" />
         <value caption="FIFO30 Interrupt (CiFSTAT set)" name="" value="0x1e" />
         <value caption="FIFO1 Interrupt (CiFSTAT set)" name="" value="0x1" />
         <value caption="FIFO0 Interrupt (CiFSTAT set)" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter Hit Number bit" name="C1VEC__FILHIT">
         <value caption="Filter 31" name="" value="0x1f" />
         <value caption="Filter 30" name="" value="0x1e" />
         <value caption="Filter 1" name="" value="0x1" />
         <value caption="Filter 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Flag Code bits" name="C2VEC__ICODE">
         <value caption="Reserved" name="" value="1001000-1111111" />
         <value caption="Invalid message received (IVRIF)" name="" value="0x48" />
         <value caption="CAN module mode change (MODIF)" name="" value="0x47" />
         <value caption="CAN timestamp timer (CTMRIF)" name="" value="0x46" />
         <value caption="Bus bandwidth error (SERRIF)" name="" value="0x45" />
         <value caption="Address error interrupt (SERRIF)" name="" value="0x44" />
         <value caption="Receive FIFO overflow interrupt (RBOVIF)" name="" value="0x43" />
         <value caption="Wake-up interrupt (WAKIF)" name="" value="0x42" />
         <value caption="Error Interrupt (CERRIF)" name="" value="0x41" />
         <value caption="No interrupt" name="" value="0x40" />
         <value caption="Reserved" name="" value="0100000-0111111" />
         <value caption="FIFO31 Interrupt (CiFSTAT set)" name="" value="0x1f" />
         <value caption="FIFO30 Interrupt (CiFSTAT set)" name="" value="0x1e" />
         <value caption="FIFO1 Interrupt (CiFSTAT set)" name="" value="0x1" />
         <value caption="FIFO0 Interrupt (CiFSTAT set)" name="" value="0x0" />
      </value-group>
