Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0512GPE064.atdf
      <value-group caption="Filter 3 Enable bit" name="C3FLTCON0__FLTEN3">
         <value caption="Filter is enabled" name="" value="0x1" />
         <value caption="Filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Selection bits" name="C4FLTCON0__FSEL0">
         <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf" />
         <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe" />
         <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd" />
         <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc" />
         <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb" />
         <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa" />
         <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9" />
         <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8" />
         <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7" />
         <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6" />
         <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5" />
         <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4" />
         <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3" />
         <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2" />
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1" />
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 0 Mask Select bits" name="C4FLTCON0__MSEL0">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3" />
         <value caption="Acceptance Mask 2 selected" name="" value="0x2" />
         <value caption="Acceptance Mask 1 selected" name="" value="0x1" />
         <value caption="Acceptance Mask 0 selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 0 Enable bit" name="C4FLTCON0__FLTEN0">
         <value caption="Filter is enabled" name="" value="0x1" />
         <value caption="Filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Selection bits" name="C4FLTCON0__FSEL1">
         <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf" />
         <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe" />
         <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd" />
         <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc" />
         <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb" />
         <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa" />
         <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9" />
         <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8" />
         <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7" />
         <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6" />
         <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5" />
         <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4" />
         <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3" />
         <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2" />
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1" />
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 1 Mask Select bits" name="C4FLTCON0__MSEL1">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3" />
         <value caption="Acceptance Mask 2 selected" name="" value="0x2" />
         <value caption="Acceptance Mask 1 selected" name="" value="0x1" />
         <value caption="Acceptance Mask 0 selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 1 Enable bit" name="C4FLTCON0__FLTEN1">
         <value caption="Filter is enabled" name="" value="0x1" />
         <value caption="Filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Selection bits" name="C4FLTCON0__FSEL2">
         <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf" />
         <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe" />
         <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd" />
         <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc" />
         <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb" />
         <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa" />
         <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9" />
         <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8" />
         <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7" />
         <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6" />
         <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5" />
         <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4" />
         <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3" />
         <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2" />
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1" />
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 2 Mask Select bits" name="C4FLTCON0__MSEL2">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3" />
         <value caption="Acceptance Mask 2 selected" name="" value="0x2" />
         <value caption="Acceptance Mask 1 selected" name="" value="0x1" />
         <value caption="Acceptance Mask 0 selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 2 Enable bit" name="C4FLTCON0__FLTEN2">
         <value caption="Filter is enabled" name="" value="0x1" />
         <value caption="Filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Selection bits" name="C4FLTCON0__FSEL3">
         <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf" />
         <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe" />
         <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd" />
         <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc" />
         <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb" />
         <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa" />
         <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9" />
         <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8" />
         <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7" />
         <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6" />
         <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5" />
         <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4" />
         <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3" />
         <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2" />
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1" />
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0" />
      </value-group>
