Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0512GPE064.atdf
      <value-group caption="Filter 15 Mask Select bits" name="C4FLTCON3__MSEL15">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3" />
         <value caption="Acceptance Mask 2 selected" name="" value="0x2" />
         <value caption="Acceptance Mask 1 selected" name="" value="0x1" />
         <value caption="Acceptance Mask 0 selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 15 Enable bit" name="C4FLTCON3__FLTEN15">
         <value caption="Filter is enabled" name="" value="0x1" />
         <value caption="Filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF0__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF0__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF0__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF0__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C2RXF0__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF0__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C3RXF0__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C3RXF0__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C3RXF0__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C4RXF0__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C4RXF0__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C4RXF0__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF1__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF1__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF1__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF1__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C2RXF1__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF1__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
