Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0512GPE064.atdf
      <value-group caption="Op amp/Comparator Reference Select bit" name="CM5CON__CREF">
         <value caption="VIN+ input connects to internal CDAC3 output voltage" name="" value="0x1" />
         <value caption="VIN+ input connects to CxIN1+ pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger/Event Polarity Select bits" name="CM5CON__EVPOL">
         <value caption="Trigger/Event generated on any change of the comparator output" name="" value="0x3" />
         <value caption="(If CPOL is 0) High-to-low transition of the comparator output / (If CPOL is 1) Low-to-high transition of the comparator output" name="" value="0x2" />
         <value caption="(If CPOL is 0) Low-to-high transition of the comparator output / (If CPOL is 1) High-to-low transition of the comparator output" name="" value="0x1" />
         <value caption="Trigger/Event generation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CM5CON__COUT">
         <value caption="(When CPOL is 0)VIN+ &gt; VTH+ / (When CPOL is 1) VIN+  VTH+ / (When CPOL is 1) VIN+ &lt; VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0)VIN+  VTH+" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp Mode Enable bit" name="CM5CON__AMPMOD">
         <value caption="Amplifier/Comparator operating in Dual mode (both Op amps and Comparators are enabled)" name="" value="0x1" />
         <value caption="Amplifier/Comparator operating in Comparator-only mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp Output Enable bit" name="CM5CON__OAO">
         <value caption="Op amp output is present on the OAxOUT pin" name="" value="0x1" />
         <value caption="Op amp output is not present on the OAxOUT pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Polarity Select bit" name="CM5CON__CPOL">
         <value caption="Comparator output is inverted" name="" value="0x1" />
         <value caption="Comparator output is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Enable bit" name="CM5CON__COE">
         <value caption="Comparator output is present on the CxOUT pin" name="" value="0x1" />
         <value caption="Comparator output is internal only" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Enable bit" name="CM5CON__ON">
         <value caption="Comparator is enabled" name="" value="0x1" />
         <value caption="Comparator is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Filter Clock Divide Select bits" name="CM5CON__CFDIV">
         <value caption="1:128 Clock Divide" name="" value="0x7" />
         <value caption="1:64 Clock Divide" name="" value="0x6" />
         <value caption="1:32 Clock Divide" name="" value="0x5" />
         <value caption="1:16 Clock Divide" name="" value="0x4" />
         <value caption="1:8 Clock Divide" name="" value="0x3" />
         <value caption="1:4 Clock Divide" name="" value="0x2" />
         <value caption="1:2 Clock Divide" name="" value="0x1" />
         <value caption="1:1 Clock Divide" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Digital Filter Enable bit" name="CM5CON__CFLTREN">
         <value caption="Digital Filters enabled" name="" value="0x1" />
         <value caption="Digital Filters disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Filter Clock Source Select bits" name="CM5CON__CFSEL">
         <value caption="PBCLK2/Timer5 Period Value (PR5)" name="" value="0x7" />
         <value caption="PBCLK2/Timer4 Period Value (PR4)" name="" value="0x6" />
         <value caption="PBCLK2/Timer3 Period Value (PR3)" name="" value="0x5" />
         <value caption="PBCLK2/Timer2 Period Value (PR2)" name="" value="0x4" />
         <value caption="REFCLK3 Clock" name="" value="0x3" />
         <value caption="PWM Secondary Special Event" name="" value="0x2" />
         <value caption="PPBCLK2 Clock" name="" value="0x1" />
         <value caption="SYSCLK Clock" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00000" name="CORE" version="">
      <register-group name="CORE" />
   </module>
   <module caption="" id="02823" name="CRU" version="2">
      <register-group name="CRU">
         <register caption="Oscillator Control Register" name="OSCCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Oscillator Switch Enable bit" mask="0x00000001" name="OSWEN" values="OSCCON__OSWEN" />
            <bitfield caption="Secondary Oscillator (" mask="0x00000002" name="SOSCEN" values="OSCCON__SOSCEN" />
            <bitfield caption="USB FRC Sleep Clock Enable bit" mask="0x00000004" name="UFRCEN" values="OSCCON__UFRCEN" />
            <bitfield caption="Clock Fail Detect bit" mask="0x00000008" name="CF" values="OSCCON__CF" />
            <bitfield caption="Sleep Mode Enable bit" mask="0x00000010" name="SLPEN" values="OSCCON__SLPEN" />
            <bitfield caption="Clock Selection Lock Enable bit" mask="0x00000080" name="CLKLOCK" values="OSCCON__CLKLOCK" />
            <bitfield caption="New Oscillator Selection bits" mask="0x00000700" name="NOSC" values="OSCCON__NOSC" />
            <bitfield caption="Current Oscillator Selection bits" mask="0x00007000" name="COSC" values="OSCCON__COSC" />
            <bitfield caption="Sleep Two-speed Start-up Control bit" mask="0x00200000" name="SLP2SPD" values="OSCCON__SLP2SPD" />
            <bitfield caption="Dream Mode Enable bit" mask="0x00800000" name="DRMEN" values="OSCCON__DRMEN" />
            <bitfield caption="Internal Fast RC Oscillator Clock Divider bits" mask="0x07000000" name="FRCDIV" values="OSCCON__FRCDIV" />
         </register>
         <register caption="FRC Tuning Register" name="OSCTUN" offset="0x10" rw="RW" size="4">
            <bitfield caption="FRC Oscillator Tuning bits" mask="0x0000003F" name="TUN" values="OSCTUN__TUN" />
         </register>
         <register caption="System PLL Control Register" name="SPLLCON" offset="0x20" rw="RW" size="4">
            <bitfield caption="System PLL Frequency Range Selection bits" mask="0x00000007" name="PLLRANGE" values="SPLLCON__PLLRANGE" />
            <bitfield caption="System PLL Input Clock Source bit" mask="0x00000080" name="PLLICLK" values="SPLLCON__PLLICLK" />
            <bitfield caption="System PLL Input Clock Divider bits" mask="0x00000700" name="PLLIDIV" values="SPLLCON__PLLIDIV" />
            <bitfield caption="System PLL Multiplier bits" mask="0x007F0000" name="PLLMULT" values="SPLLCON__PLLMULT" />
            <bitfield caption="System PLL Output Clock Divider bits" mask="0x07000000" name="PLLODIV" values="SPLLCON__PLLODIV" />
         </register>
