Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0512GPE064.atdf
         <register caption="Interrupt Vector Address Offset Register" name="OFF002" offset="0x548" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF003" offset="0x54c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF004" offset="0x550" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF005" offset="0x554" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF006" offset="0x558" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF007" offset="0x55c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF008" offset="0x560" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF009" offset="0x564" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF010" offset="0x568" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF011" offset="0x56c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF012" offset="0x570" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF013" offset="0x574" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF014" offset="0x578" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF015" offset="0x57c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF016" offset="0x580" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF017" offset="0x584" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF018" offset="0x588" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF019" offset="0x58c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF020" offset="0x590" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF021" offset="0x594" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF022" offset="0x598" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF023" offset="0x59c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF024" offset="0x5a0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF025" offset="0x5a4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF026" offset="0x5a8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF027" offset="0x5ac" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF030" offset="0x5b8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF031" offset="0x5bc" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF032" offset="0x5c0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF033" offset="0x5c4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF034" offset="0x5c8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF035" offset="0x5cc" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF036" offset="0x5d0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF037" offset="0x5d4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF038" offset="0x5d8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
