Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0512GPE064.atdf
         <register caption="SPI Status Register" name="SPI1STAT" offset="0x10" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI1STAT__SPIRBF"/>
            <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI1STAT__SPITBF"/>
            <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI1STAT__SPITBE"/>
            <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI1STAT__SPIRBE"/>
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI1STAT__SPIROV"/>
            <bitfield caption="Shift Register Empty bit" mask="0x00000080" name="SRMT" values="SPI1STAT__SRMT"/>
            <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI1STAT__SPITUR"/>
            <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI1STAT__SPIBUSY"/>
            <bitfield caption="SPI Frame Error status bit" mask="0x00001000" name="FRMERR" values="SPI1STAT__FRMERR"/>
            <bitfield mask="0x001F0000" name="TXBUFELM"/>
            <bitfield mask="0x1F000000" name="RXBUFELM"/>
         </register>
         <register caption="SPI Status Register" name="SPI2STAT" offset="0x210" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI2STAT__SPIRBF"/>
            <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI2STAT__SPITBF"/>
            <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI2STAT__SPITBE"/>
            <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI2STAT__SPIRBE"/>
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI2STAT__SPIROV"/>
            <bitfield caption="Shift Register Empty bit" mask="0x00000080" name="SRMT" values="SPI2STAT__SRMT"/>
            <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI2STAT__SPITUR"/>
            <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI2STAT__SPIBUSY"/>
            <bitfield caption="SPI Frame Error status bit" mask="0x00001000" name="FRMERR" values="SPI2STAT__FRMERR"/>
            <bitfield mask="0x001F0000" name="TXBUFELM"/>
            <bitfield mask="0x1F000000" name="RXBUFELM"/>
         </register>
         <register caption="SPI Status Register" name="SPI3STAT" offset="0x410" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI3STAT__SPIRBF"/>
            <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI3STAT__SPITBF"/>
            <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI3STAT__SPITBE"/>
            <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI3STAT__SPIRBE"/>
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI3STAT__SPIROV"/>
            <bitfield caption="Shift Register Empty bit" mask="0x00000080" name="SRMT" values="SPI3STAT__SRMT"/>
            <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI3STAT__SPITUR"/>
            <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI3STAT__SPIBUSY"/>
            <bitfield caption="SPI Frame Error status bit" mask="0x00001000" name="FRMERR" values="SPI3STAT__FRMERR"/>
            <bitfield mask="0x001F0000" name="TXBUFELM"/>
            <bitfield mask="0x1F000000" name="RXBUFELM"/>
         </register>
         <register caption="SPI Status Register" name="SPI4STAT" offset="0x610" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI4STAT__SPIRBF"/>
            <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI4STAT__SPITBF"/>
            <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI4STAT__SPITBE"/>
            <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI4STAT__SPIRBE"/>
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI4STAT__SPIROV"/>
            <bitfield caption="Shift Register Empty bit" mask="0x00000080" name="SRMT" values="SPI4STAT__SRMT"/>
            <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI4STAT__SPITUR"/>
            <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI4STAT__SPIBUSY"/>
            <bitfield caption="SPI Frame Error status bit" mask="0x00001000" name="FRMERR" values="SPI4STAT__FRMERR"/>
            <bitfield mask="0x001F0000" name="TXBUFELM"/>
            <bitfield mask="0x1F000000" name="RXBUFELM"/>
         </register>
         <register caption="SPI Status Register" name="SPI5STAT" offset="0x810" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI5STAT__SPIRBF"/>
            <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI5STAT__SPITBF"/>
            <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI5STAT__SPITBE"/>
            <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI5STAT__SPIRBE"/>
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI5STAT__SPIROV"/>
            <bitfield caption="Shift Register Empty bit" mask="0x00000080" name="SRMT" values="SPI5STAT__SRMT"/>
            <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI5STAT__SPITUR"/>
            <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI5STAT__SPIBUSY"/>
            <bitfield caption="SPI Frame Error status bit" mask="0x00001000" name="FRMERR" values="SPI5STAT__FRMERR"/>
            <bitfield mask="0x001F0000" name="TXBUFELM"/>
            <bitfield mask="0x1F000000" name="RXBUFELM"/>
         </register>
         <register caption="SPI Status Register" name="SPI6STAT" offset="0xa10" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI6STAT__SPIRBF"/>
            <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI6STAT__SPITBF"/>
            <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI6STAT__SPITBE"/>
            <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI6STAT__SPIRBE"/>
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI6STAT__SPIROV"/>
            <bitfield caption="Shift Register Empty bit" mask="0x00000080" name="SRMT" values="SPI6STAT__SRMT"/>
            <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI6STAT__SPITUR"/>
            <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI6STAT__SPIBUSY"/>
            <bitfield caption="SPI Frame Error status bit" mask="0x00001000" name="FRMERR" values="SPI6STAT__FRMERR"/>
            <bitfield mask="0x001F0000" name="TXBUFELM"/>
            <bitfield mask="0x1F000000" name="RXBUFELM"/>
         </register>
         <register caption="" name="SPI1BUF" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI1BUF"/>
         </register>
